#!/bin/bash

#######################################################
## 説明:
##   benchmark.rsを実行するためのスクリプト
##
## 実行方法:スクリプト実行時の第一引数は要素数
##   ./execBenchMark.sh 26 or sh ./execBenchMark.sh 26
##
#######################################################

ELEMENT=$1

echo "/**********************************************"
echo "バイトニックソートのベンチマークを開始します"
echo "**********************************************/"

cargo run --example benchmark -- ${ELEMENT} --release

echo "/***********************************************"
echo "バイトニックソートのベンチマークが終了しました"
echo "***********************************************/"
